---
kind: property
id: P:Autodesk.Revit.DB.Visual.AdvancedWood.WoodUseGrooveRoughness
source: html/2b7b2843-ea77-2795-c679-94650df49663.htm
---
# Autodesk.Revit.DB.Visual.AdvancedWood.WoodUseGrooveRoughness Property

The property labeled "Use additional groove roughness" from the "AdvancedWood" schema.

## Syntax (C#)
```csharp
public static string WoodUseGrooveRoughness { get; }
```

## Remarks
This property is of type "AssetPropertyBoolean".